var sBigGood = "너의 순위는,들의 발,싱어게,마이 턴,꾼들,마이턴,오은영 스테이,스트릿 우먼,브레인,위대한쇼,취미는,신인감,알아두면,옥탑방의,알쓸별잡,미스터트롯,마법의,동호회,늦기전,국민 참견,모던인,유 퀴,골 때,매직스,결혼지,스 온 파,즘 육아,돈워리,애의 참견,아이가 달,한문철,혼 지옥,벗은 세,금쪽 상,싱포맨,꼬리에,추리,벗은 세,쌤과 함,팬텀싱,뭉쳐야,신비한TV,문제적,싱어게";
 
var sBigBad = "하나부터 열까지,거리의 의,엄홍길,누난 내,세상을 비집,TTA,피프티 트립,찐이네,흙심인,한 컷,띵동택,길치라도,런포유,히든카드,사제 공감,콩콩,투 찐이네,더 리슨,입 터지는,나부터 열,잡학자,길치라도,배달왔,바디인사,행님,돈마카,배불리,전국 1등,이민정,정용화의,크레이지 리치,왔수다 만,방판뮤직,개호강,아무도 몰,우리는 잉꼬,류학생어,남겨서,스타건강랭,안목의 여,일타맘,두유노집,플래닛,LIVE WIRE,장르가 머,건강 하,라이브 와이어,방판뮤직,아임 써,비 마이,경이로운 도,알아야산,제철남,오브 걸스,숨바꼭,인물사,밥친구,팽봉,뛰어야,Chat Hearts,신빨,싱코리,생이 영,슈퍼문,길바닥 밥,제일 잘,뽈룬티,대환장,길바닥 밥,지지고 볶는,눈 떠보,오래된 만,도라이버,이혼보험,직장인,K-밥,더 시즌즈,지지고볶,굿데이,아보고서,와 놀부,최화정,주관식,하트페,챗하츠,내편하,K밥,독립영화,다컸는,이버 잃,리 아침식,특집 썰,퀵빌드,추라이,컨츄리쿡,밥심,글로벌가,근의 겨,을 비집고 해,시티투,렐라게,원탁의,세차JA,트롯,신빨토,셀럽병,솔로지,사 한 끼,발리우드,이즈 잇 케,포춘 핌,사랑의 진,안소니 제,레이지 딜,최후통첩,너에게 닿,내주는부,여기가 딱,김원희의,불꽃소,긍정왕,튜디오K,기안이,시골마,핑퐁스,정국 :,미 싱,상에 이런,라 불꽃 소,장고를 부,썸가이즈,주로 둘,일은 밥,니버스 리,슈팅스,란드 셋방,건문검,신의 레,기의 주부,설의 취사,영지의 레,장고를 부,주로 둘이,심야 괴,에너미X,걸스 온 파,승환의 초,리가 들려,나라는 가,빠들 우,의 미식전,젝트7,더 인플,마술랭,다 컸는,다이스 아일,SCOOL,타라이트 보,갈 데까,촌스러,솔로라,백팩,JECT 7,물려줄 결,극한투,개의 눈,혼전연,주는 부,먹방,사지 로,진심누,히든아,더 트롯,이의 사,이혼숙,천 개의 눈,도시 Z,소드클,별의별,끝사랑,인가수 조정,정글밥,태어난 김,공개연,더트롯쇼,도림 조,이게 맞,나는 솔,에스파,MY ARTi,젠블루의,K-빵을,간이 되,의 여행본,쇼챔피,OF ARrC,파리올,디오 여행,차가 부,남의 연,야구대,거인의 어,무비월드,음악중심,THE 국돼,리얼 도전,파리 올,이네임이,영상 재생,놀라운토,라리가 2,우마 코,녀가 죽,터리 수,롯쇼 라,펙트 매,집 금송,악몽의 룸,튼 소유,이엠 온,욱의 욱,더쇼,팝업상,주는 비,러브 온,스프린트,금한 이,라 강연,적 60,is 가브,환장 한,스터로,계기사,콘서트,희의 질,것이 알,둘이 여,개그콘,디컬다,줄여주 ,제 혼자,우리동,귀신전,브 아크,생생정,내고향,종세상,언니네,무카세,수사대 스,이 순간,살인 사,다시갈,2장1,MA1,말을 꼭,설록 : 네,PD수,최.강,들린 연,의 돌직,방송 오,좋은 아,행복한 아,인간극,대영 라,최강식,강철지,건강의,ENA 케,미트립,이 여행갈,적인 여,루 모멘,라 딴따,왕국 여,로 패키,한일톱텐,리얼 연애,케바케,컴 투 장,외진 마,고 등짝,조선의 남,지락이,MAKEMATE,틈만나,장안의 화,엔드 소금,잔혹범,건축,찐팬,퇴근길,까스의 왕,이나 한,전국투,동물의 왕,은퇴설,눈떠보,텐트밖,취향존,록- 네,수종의 여,늘 라베,짠남자,결사들,틈만 나,제일in건,진실 혹,명곡 챔,2장 1,취향z,밥집,THE 드라,스쓰리,밥상차,쇼군,TOP7,M COUNT,꽃중년,해준다 인,건강 인,이트 연결,하입보,NEXZ,전드 수,위대한 탄생,갈라쇼,식탐상,HOPE ON THE,Eightest,먹고 보는,청소광,놀던언,고민순,세모집,한일가왕,슈퍼 코,없어, 카,의 한 수,이나의,홍판사판,켓세일정,보자GO,푸바오,100세 더,이코멘터,는 자연,역전의 가,엄[지]윤,연애남,댄서스,탑골 디,참견재,웨이홈,헬로아,트 404,사회생,돈쭐,손절,어서 세,말 건강,육아일,구독왕,대학체전,대한 가,28청춘,진성 빅,이혼할,덩치 서,운 우리,나는 세,싱어송 파,성적을 부,송스틸,술가의,용식탁,탐정들의,톡파원 2,MAKE미,불타는 트,아이엠그,솔로동,커플팰,배우반,현역가,서치9,간 입맛,브로 앤,아빠하,최자로,과몰입,현무계,남의 나라,반려동,나나투,빌드업,더 와일드,불로촌,타 유전,국악,서민갑,깐죽,맨인유럽,효도하,왔다 내,오구오,Law맨스,미꽃 필,금 화가 나,무장해제,스타 맛,중매술,나랏말,면 핫플,캠프 제,더 디저,댄스가,터 로또,몸쓸,난 건강,R U N,귀염뽕,집에 있,맛판사,니돈내,신 몸,결혼전,키든타,웃는 사,에 세계일,계 기사,뽕사활,쇼퀸,시골경,쉬는 부,하던 짓,레이유,속설검,늘도 주,동네스,하트시그,벗은 한,미친원,짠당포,쩐생연,지구탐,강심장,트랄랄,만국 견,닭 싸,버텨야,위장취,아홉 스,부산촌놈,미스터트롯2,명의들,수학 없,노머니,퇴근 후,진이네,그림형,결혼 말,풀어파,설박사,치토커,즈 플래닛,잘사는,장바구,의 식판,스윙스,지구마불,모내기,혼파괴,편의점,런닝맨,집사부,래하는 대,장사천,혜미리,더 퀸즈,환장 속,걸스 나,프리한 닥,더 시즌,사랑꾼,적인 동남,하하버,스 빌런,뭉뜬,고기서 ,불타는 장,게 왜 맛,일타강,크타임,모킹 건,미더머,캠핑 인,손 없는,효자촌,엄마아빠,외국인,운 토요,세컨 하,한도초과,테라스 온,엄마아빠!,떼춤,달리는 풀,먹자 GO,진격의 언,개며느,복덩이들,레전드 기,고독한 훈,매드 지,찐친 이,펫미픽,청춘M,쯤 킬리,버디보이즈,추얼 웹,시사멘터,낭만비박,뻥쿠르,순정시,세계테,서울 체,대쪽 상,상암동 클,위기탈출,아바드림,이츠 마,우리들의 쇼,혼에 진심,날 따라와,K-909,네마인드,배틀트립,뉴진스,회장님네,천하제일장,아티스탁,들의 남진,슈퍼모델,A에 있지,막사세,스타탄생,리셋 재데뷔,수요일도 밤,레이리스,환승연,전의 한방,아바타 싱,봐 탈골됐,얼라이,중독자들,종점여행,째 세계,러브in,강철볼,장타왕,KPOP Maker,더 리즈,차이나는 K,루틴왕,각자의 본,운탄고도,첫사랑,의 차차,리 듀엣,나의 영웅,식자회,텐트 밖,연애는 직,쇼터뷰,새집은 처,셀럽이 되,인더숲,웅들의 탄,비밀남,버는 젊,허섬세,대한 유산,올웨이즈,홍김동,브런치 톡,푸어라,지마 심,뿅뿅 지,인더숲셀럽이 되,포자락 휘,술은 처,리슨 업,추리반 2,영 앤 리,배우는 캠,도 리콜,케이 오,리 홀인,소시탐,을 잊은 음,의 계절에,울 인베,에덴,B-SIDE,허삼부,영화인,해밍턴,뿅뿅지,환승인생,O씨네,임채무,물 건너,오 마이 웨,다시 첫,아!나 프,라이 투,런치톡,터들의 썰,몸을 바꾸,스카우트,지킬박사,딱이의 역,뉴페스타,최강야구,원아 사나,대스리가,고 스캉스,청춘스타,DNA 싱어,백패커,다 어른,요즘 것,서민 갑부,뉴스,족관계증,쇼! 챔피,클라씨,있지코,리는 외박,죽기 전 보,70억의 선,심장이 뛴,만복식,빼고파,청춘야구,블록버스터,마는 예뻤,책 읽어,구촌 뉴스,LOUD 그,밖의 여정,변호의 신,번주도 잘,원아 여행,컴백쇼,쇼킹 받,라의 라떼,다시 언니,본주의 학,채널A 스포,트를 달,면가왕,건강 스,블랙: 악,쇼다운,티에이짐,라의 라떼9 1,시 갈 지,오픈런,아침마,침 매일경,1:1 문의,문의는 1:1,토리 추,방랑고,진격의 할,딸도둑,투 더 그라,신과 함,울체크,국민동요,디 오리진,마법옷장,빽 투 더그,구인 더 하,Zㅏ때는,우리_사이,장미의 전,상한 이웃,립식 가,판 서프,는 식구당,싱포레스,블랙- 악,리 이혼,즈 베러,감한 형사,신 하우,퀸덤,차트 시스,백투더북스,고딩엄빠,빈집살래,두심이 좋,국가수 ,클 푸드,에이핑,컬식탁,올 탁구,국대는 국,건강 문제,꾼 도시 여,물여지도,국가가 부,TMI SHO,나무 식,신과 한판,베이징,컬링 퀸,옛날TV 그,된 밥집,사랑 X,장 단짝,공생의 법칙,주접이 풍,극장 단짝.신과 한판,호적메,푸는 베,끼리 작,신랑수,나리학,서는 식,슈퍼 DN,정치합,개승자,주주총,자족 원,빅데이,출 수밖,강한 참견,부캐전성,공상가들,마미안,트로트,꾼의 탄,을애가게,리 식구됐,얼건강스,트레킹노,스트 ONCE,불편해도,더 솔져,데뷔의 순,든일레,담자들,위대한 식탁,누구세탁,헬로트로,진리식당,한연애 XL,칼의 전쟁,혼은 미친,간 산악,롤 더,BS바둑,골벤져,은 밤이 좋,은 밥이 좋,재지골,채소가,민국 치,드PT,동굴캐,브로 꿈,름은 캐,쾌한 상,후 설렘,고 공치,더 스트,그랜파,강비결 좋,를 불러줘,라켓보,경양식,집콘LIVE,순간을 기,마법 옷,쇼프로,한줄광,리슨:,볶이집,잠적,나다같,해치지않,갓파더,라잇썸,워맨스,운 산촌,운동천,G식,요리,야생돌,해GYM,간 JTBC,국민영수,펫키지,바퀴달,SNL,리더의 하,닥터T,엘라스트,는 SOLO,호의 파일,밀한 뉴,더숲 세븐,노포의 영업,면 흥하,중 여행배,랑의 콜센,EIDF 20,쭐내러 왔,기로 했,가곡다방,네 클라,2PM 와,더의 연,시는 녀,니가 쏜,이시 걸,벌 가족퀴,스플래닛,로운 덕후,알맹이,골프,야구왕,DOM WEEK,동행 오,드의 힘,꿀 유레,핑존 골,도쿄,서 온 퀴,-TAC,로 육아,강철부,츠 문제,방과 음,세리머,더 플레,CIX,수라장,도주막,혼밥인,라던 바,와카남,돌싱글,퍼밴드,미랑 노,골프왕,해방타,지켜츄,실연박,랜선 장,실을 검,전 라이,평생동안,국제부,애도사,직송 프,트릿 커,사가 온,닥터W,소생 프,LP바,는 브로,배를 뜯,썹 K-할,요 청백,e 2 HO,보 브런,불꽃미,빵카로,얼짱사,닥터M,아리 하,티키타,문하는 기,택 골든,방쿡쿡,달린 집,이스 킹,딸 하자,유명가,컴백홈,업글인,르의 고양,줘 홈,더리 워,트롯 매,소니 아,투더뮤,십오야,문난 님,굴 인터,집콕 콘,라 댕댕,타임 씨,루팡 에,간이역,멋동산,쩌다 사,니의 스,썰바이,리스또,일기 프,OPAL이,발견 유,애 첫 독,일드 퀴,리박,강청문,극한고,포츠 뉴,수미산,의 골든,사진 정,롯 쇼,물티비,트의 민족,편한 카,돌아보,배달G,빽사이,캡틴,야괴담,CTO,판타집,마녀들,빨간 신,윤스테,시대 요,달고파,빈집 살,닷가 사,부른 소,아카이브,명심보,스타다,체인지,츠 투나,트 라이,트롯 전,족이 맞,승준의,누리쇼,드 정보,인생토,열린세,중계석,친 그 개,방곡곡,온드림,실화탐,동네 한,장님이 미,의 달인,킹스,말 겨루,강한 집,한 진료,이웃집,의 습관,랑 투유,견 배우,란만장,알약방,의 밥상,알짜,런 친구,포츠 야,롯파이,더 라이,을 싣고,쇼 황금,스친송,양이를 부,나쁜 개,천기누,장학퀴,진품명,강면세,팡터지,츠 매거,인 블랙박,쇼 음,요 랭킹,악한마,북유럽,적의 인,터 지바고,출발 비,C.T.O,트롯 파,우리 결,긴어게,든지 베,어바웃펫,도시탈출,능 따라,리는 사,움 북유,이브 온,면 쏜다,는 정남,인앱,정원일기,심포유,라떼부,로망대,전 여고동,PEN Hi,의 히트제,캐 선발대,이 서울,구말구,기 살래,로운 생활,족의 재,만 빌리,바다경찰,름을 부르,인생앨,먹고 가,세얼간,나야나,드 레코,NCT ,핑크 페,운 챔피,길 선발,희망의 보,펫 비타,깨춤,운 소비생,집이 없다,쓰백,니한텐 말,위 캔 게,로또싱,러브샷,갬성캠,터 리부트,레저 맵,살아있네,배낭 메,맛집,원하는대로,V 라떼,날이 장,미네 비,라면,[웹예능,랜선 집,가짜 사,올인,전교톱1,절찬제작,더 체크,DIMF 뮤,쩐당,디오 K,는 차였,노는 언,위클리,육자회,할명수,도 과학,트원정,멘탈 캠,로 이식,TOO M,디오스,다시 뜨,무튼 출,강한 가,상을 밝,과 후 활,울촌놈,데소,위플레,의 강연,름방학,어로 써,동해수,POP 한,리 쏭쏭,캐치 티,이 삽시,른 미팅,국인의 노,연중 라,ON 트,한 정리,전담 수,집쿡라,트레이 키,식벤져,I-LAND,드루와,아픈 개,오즈 마,백파더,드 이발,바퀴 달,게인 코,안디 무,아이즈원,JOB룡,감자덕,뷰티,BTS,X TOGE,먹힐까,1호가,GOOD GIRL,뽕숭,시네세,홈데렐,식하는,의 파트,탑골 랩,온앤오,樂,통의 가,자 루크,GOT7,또깨,문 바다,g Seventeen,헬로키,그랑 만,어 올리,유후 구,드 투 킹,탠드 업,뚝딱맨,시세끼,이엠 소,이스 T,초이카,김창옥,세기 힛,한마켓,몰랑,즈와 음,문판매,의 공룡,말괄량이 삐,선이 음,Run BT,SF9,매직큐브,이 스머,ARM!,퍼윙스,사 가제,드림 스,우 소미,기 미치,맨땅에,타엑스,녕, 다,수다승철,신이 떴,지는거다,지GO,리스쿨,녕 다니,UNVS,맞짱,닥터셰프,밥블레,는 트로,밍글라,사의 선,거래 유,블 캐스,공부하기,희가 힙,마포 멋,귀찮아,더 로맨,구방위,바람숲,올드송,해요와,과 바다,꽉찬,트래블,예술아 놀자,TMI N,여왕의 전,배철수, MI NEWS,페이크다,첫 사회,음악당,리에 있,한 예능,악동창,리가 보,요일 밤,스 공감,RUN,빅플레저,주무관,슛돌이,침착한,좋은친,미식가,행기 타,가는 날,다함께 차,와이낫,작자들,나만 믿고,엠카운,더 쇼,가요무대,인중재사,뽀뽀뽀,1박 2,로우 미,열린음,기가요,래자랑,술무대,C 쇼 음,는 TV,영어하기,보이는 라,롱롱,션 런닝,캡슐보,금만담,더 클래식,펭TV,편스토랑,맛남의,열린 세,아이돌,의 맛,다니냐,겟잇뷰,백반기,뮤직뱅,로루키,모던 ,라끼,펀스토,썸바디,강적들,영화가,접속 무,유희열,노래가 좋,혼자 산,서유기,맛있는,월드 클,슈가맨,틀 트,놀면,의 명곡,개그 ,전지적,동치미,정글의,씨름,상이몽,알토,의 양식,일킹,행 프로,는 형님,잠은행,오여행,아빠본,방구석,다녀오,만나러,물농장,모란봉,돌룸,엄지의,사이몽,마이 리,슈퍼맨이,구해줘,귀는,넘는,코미디,얼마,고부열,판도라,리한1,풍문,짠내,간 아이,몸신,타요,는 청춘,예 한밤,천일야,오 스타,내의 맛,쇼 챔,밀일기,니 하니,빠샤,카봇,애니갤,친구는 빅,간아이,영재발,는 클라,반찬,리와인,한끼,백종원,황금어,꾸러기,뿡뿡,레스큐,공부책,유치원,잘하나,또봇,핑크퐁,딩동댕,뮤직박,올댓,시청자,연예수,어보살,연예통,이런일,열린채,자동공,방귀,룡파워,페파,피피루,피투게,어서와,시청자,열린 세,어보살,알콩,편애,전담반,길길,반반,콘택트,훌륭,스럽게,이태리,벅스봇,걸어보고,후계자들,ACE,남자들,쇼핑,사랑할,토크가,오늘부터,공유의,호기심,콩순이,스토니즈,러브캐처,만난 사이,쌀롱,옛능";
var sBigBad2 = ",언프리티,두집살림,들의 수다,띵동택,셰프의,좋아효,여행,내 몸을,까칠한,석삼플,메이크업,불꽃야,옷장전,짧아유,뚜벅이,멸치캠,각집부부,소개팅,괴담노트,촌장주,더 차트,긴머리 휘,새끼의 연애,입만 살,쏠로,진서연의,우리 아기가,개와 늑대,진짜 괜찮,화성인이,살롱드돌,박소현의,BOYS II,공동여행경,밥값은,로 튈지,신과함,남즈나,스토랑,슈퍼콩서,다큐,NEWS,어떻게살,일 24시,소나무,시사스페,100분토,히든 아,인생의 연,다큐 플,일요진단,경규의 경,동행,팔도밥,다큐초,저출생 위,RIIZE,사건 반,네트워크 매,네트워크 특,스트레이트,PD로그,네트워크,내 몸을 살,MBC 네,슬기로운 아,살맛나는 오,메소드 클,시사기획 창,시사쇼,보도본부,장수상회,굿모닝 MBN,JTBC 아침,생활의 발견,생로병사,명을 사,질병의 법,고향민,월드 24,생생 정,신통방통,굿모닝 정,무엇이든 물,좋은아침,나이트라인,리뷰네,다큐멘터리K,다큐 인사,보스 라이,피크닉 라,마사지로,JTBC 사건,생방송 투,케이팝업,고향이 보,사건파일 24,사사건건,EBS 초대석,세상에서 가,기분 좋은,KBS 네,나눔 0700,사랑의 가족,건강스페셜,꽃길만,남북의 창,명의,여왕벌 게,한국기행,추적60,영화 클래,마의 봄,100세 프,게 살 것,는 건강,앨범 산,말은 오,특파원 보,극한직업,내 부모님,한형사,킴의 커,무쇠소,우리가락,다큐 온,의 힘고,로벌 특,가유산 순,접속! 무비월드,쇼! 음악중심"; 

function bFind(saValue, sText, bExact)
{
   sText = sText.trim();
   for(var i = 0; i < saValue.length; i++)
   {
      if(!bExact && sText.indexOf(saValue[i]) != -1)
        return true;
      else if(bExact && sText == saValue[i])
        return true;
   }
   return false;
}

// stop for sometime if needed
//window.onload = function(){}
//var bCheckMain = (window.location.href.indexOf("mod=document")==-1);
//setTimeout(function() {myFunction("ktownstory", "", "", bCheckMain, true)}, 2000);

//window.onload = function(){}
//var bCheckMain = (window.location.href.indexOf("/tv_shows_cat/")!=-1);
//setTimeout(function() {myFunction("25tv", "", "", bCheckMain, false)}, 2000);

//window.onload = function(){}
//var bCheckMain = (window.location.href.indexOf("&wr_id=")==-1);
//setTimeout(function() {myFunction("kotbc", "", "", bCheckMain, true)}, 2000);
function findParentWithClass(node, class_name, count)
{
  if (count == 0 || node === undefined || !node)
		return null;
 
  if (node.className !== undefined)
  {
  var classes = node.className; 
  //alert(classes);
  
  if(classes.indexOf(class_name) == 0)
  {
  	//alert(classes);
   	return node;
  }
   else
	   return findParentWithClass(node.parentNode, class_name, count-1); 
  }
   else
	   return findParentWithClass(node.parentNode, class_name, count-1); 
}

function myFunction(sMode, sExtraGood, sExtraBad, bCheckMain, bRedirect) 
{     
    var sSubMode = "";
    var index = sMode.indexOf(":");
    if (index !== -1)
    {
     sSubMode = sMode.substring(index+1); 
     sMode = sMode.substring(0, index); 
    }

    if (sMode == "tv25")
    {       
        var btn = document.querySelectorAll('.fc-close');
        //console.log(btn);
        btn[0].click();
    }
    
    var sAllGood = sBigGood + sExtraGood;
    var sAllBad = sBigBad + sBigBad2 + sExtraBad;
    var saGood = sAllGood.split(",");
    var saBad = sAllBad.split(",");
    
    var imgs = document.querySelectorAll('img');
    
    for (var i = 0; i< imgs.length; i++) 
    {
    	imgs[i].style.visibility = "hidden";
    	imgs[i].style.display = "none";
    	imgs[i].width = 0;
    	imgs[i].height = 0;
    
    }    
    
    var anchors = document.querySelectorAll('a');
	if (sMode == "div")
		anchors = document.querySelectorAll('div');
    var link = [];
    var goodElement, badElement;
    for (var i = 0; i< anchors.length; i++) 
    {
      link = anchors[i];
      goodElement = link;
      badElement = link.parentNode.parentNode;
      
      //console.log(link.innerHTML);
      //alert(link.innerHTML);
      if (sMode == "ktownstory")
      {
      }
      else if (sMode == "s")
      {
          badElement = link;
      }
      else if (sMode == "p")
      {
          badElement = link.parentNode;
      }
      else if (sMode == "ppp" || sMode == "kotbc")
      {
          badElement = link.parentNode.parentNode.parentNode;
      }
      else if (sMode == "pppp" || sMode == "tv25")
      {
	      badElement = link.parentNode.parentNode.parentNode.parentNode;
      }
      else if (sMode == "pp" || sMode == "tv25m" || sMode == "viva")
      {
	      badElement = link.parentNode.parentNode;
      }
      
      if (bCheckMain && bFind(saBad, link.innerHTML, false)) 
      {
    	//alert(link.innerHTML);
    	//console.log("bad: " + link.innerHTML);
	
	if(sSubMode != "")
	{
	  var hasCSS = findParentWithClass(link.parentNode, sSubMode, 10);
          if(hasCSS !== undefined && hasCSS !== null)
		badElement = hasCSS; 	
	}
	
	badElement.style["display"] = "none";
      }	
      else if (bCheckMain && bFind(saGood, link.innerHTML, false)) 
      {
    	//alert(link.innerHTML);
        goodElement.style["font-weight"] = "bold";
    	  goodElement.style["font-size"] = "18px";
    	  goodElement.style["color"] = "#53a822";
    	//console.log("good: " + link.innerHTML);
      }
      else if (sMode == "kotbc" && bCheckMain && link.innerHTML.indexOf("Update!") != -1) 
      {
    		//alert(link.innerHTML);
    		//console.log("bad: " + link.innerHTML);
        link.parentNode.style["display"] = "none";
      }	      
      else if (bCheckMain && sMode == "tv25m" && link.href.indexOf("/tv_shows/") != -1) 
      {
        //alert(link.innerHTML);
        //console.log("bad: " + link.innerHTML);
        badElement.style["display"] = "none";
      }   
      else if (bRedirect && (link.innerHTML.indexOf("airst") != -1 
      || link.innerHTML.indexOf("filemoon") != -1
      || link.innerHTML.indexOf("luulu") != -1
      )) 
      {
      	//console.log("finish ==================== : ");
      	setTimeout(function(){
        	var win = window.open(link.href, "_self");
    		win.focus();
      	}, 1000);
    		break;
      }
    }
}
